remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi_flash.h
/**
 * \file
 *
 * \brief Component description for SPI_FLASH
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_SPI_FLASH_COMPONENT_
#define _SAMB11_SPI_FLASH_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SPI_FLASH */
/* ========================================================================== */
/** \addtogroup SAMB11_SPI_FLASH SPI Flash Controller 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define SPI_FLASH_SF1234
#define REV_SPI_FLASH                    0x100

/* -------- SPI_FLASH_MODE_CTRL : (SPI_FLASH Offset: 0x00) (R/W 8) SPI Flash Mode Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  MODE:2;                    /**< bit:   0..1  SPI Modes                                */
    uint8_t  BYPASS_CS_PRE:1;           /**< bit:      2  Bypass CS PRE state                      */
    uint8_t  BYPASS_CS_POST:1;          /**< bit:      3  Bypass CS POST state                     */
    uint8_t  :3;                        /**< bit:   4..6  Reserved */
    uint8_t  MODE_SELECT:1;             /**< bit:      7  Set to 1 to use external bits for mode   */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_FLASH_MODE_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FLASH_MODE_CTRL_OFFSET          0x00                                          /**<  (SPI_FLASH_MODE_CTRL) SPI Flash Mode Control  Offset */
#define SPI_FLASH_MODE_CTRL_RESETVALUE      0x00u                                         /**<  (SPI_FLASH_MODE_CTRL) SPI Flash Mode Control  Reset Value */

#define SPI_FLASH_MODE_CTRL_MODE_Pos        0                                              /**< (SPI_FLASH_MODE_CTRL) SPI Modes Position */
#define SPI_FLASH_MODE_CTRL_MODE_Msk        (0x3u << SPI_FLASH_MODE_CTRL_MODE_Pos)         /**< (SPI_FLASH_MODE_CTRL) SPI Modes Mask */
#define SPI_FLASH_MODE_CTRL_MODE(value)     (SPI_FLASH_MODE_CTRL_MODE_Msk & ((value) << SPI_FLASH_MODE_CTRL_MODE_Pos))
#define   SPI_FLASH_MODE_CTRL_MODE_0_Val    0x0u                                           /**< (SPI_FLASH_MODE_CTRL) Mode 0  */
#define   SPI_FLASH_MODE_CTRL_MODE_1_Val    0x1u                                           /**< (SPI_FLASH_MODE_CTRL) Mode 1  */
#define   SPI_FLASH_MODE_CTRL_MODE_2_Val    0x2u                                           /**< (SPI_FLASH_MODE_CTRL) Mode 2  */
#define   SPI_FLASH_MODE_CTRL_MODE_3_Val    0x3u                                           /**< (SPI_FLASH_MODE_CTRL) Mode 3  */
#define SPI_FLASH_MODE_CTRL_MODE_0          (SPI_FLASH_MODE_CTRL_MODE_0_Val << SPI_FLASH_MODE_CTRL_MODE_Pos)  /**< (SPI_FLASH_MODE_CTRL) Mode 0 Position  */
#define SPI_FLASH_MODE_CTRL_MODE_1          (SPI_FLASH_MODE_CTRL_MODE_1_Val << SPI_FLASH_MODE_CTRL_MODE_Pos)  /**< (SPI_FLASH_MODE_CTRL) Mode 1 Position  */
#define SPI_FLASH_MODE_CTRL_MODE_2          (SPI_FLASH_MODE_CTRL_MODE_2_Val << SPI_FLASH_MODE_CTRL_MODE_Pos)  /**< (SPI_FLASH_MODE_CTRL) Mode 2 Position  */
#define SPI_FLASH_MODE_CTRL_MODE_3          (SPI_FLASH_MODE_CTRL_MODE_3_Val << SPI_FLASH_MODE_CTRL_MODE_Pos)  /**< (SPI_FLASH_MODE_CTRL) Mode 3 Position  */
#define SPI_FLASH_MODE_CTRL_BYPASS_CS_PRE_Pos 2                                              /**< (SPI_FLASH_MODE_CTRL) Bypass CS PRE state Position */
#define SPI_FLASH_MODE_CTRL_BYPASS_CS_PRE_Msk (0x1u << SPI_FLASH_MODE_CTRL_BYPASS_CS_PRE_Pos)  /**< (SPI_FLASH_MODE_CTRL) Bypass CS PRE state Mask */
#define SPI_FLASH_MODE_CTRL_BYPASS_CS_PRE   SPI_FLASH_MODE_CTRL_BYPASS_CS_PRE_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_MODE_CTRL_BYPASS_CS_PRE_Msk instead */
#define SPI_FLASH_MODE_CTRL_BYPASS_CS_POST_Pos 3                                              /**< (SPI_FLASH_MODE_CTRL) Bypass CS POST state Position */
#define SPI_FLASH_MODE_CTRL_BYPASS_CS_POST_Msk (0x1u << SPI_FLASH_MODE_CTRL_BYPASS_CS_POST_Pos)  /**< (SPI_FLASH_MODE_CTRL) Bypass CS POST state Mask */
#define SPI_FLASH_MODE_CTRL_BYPASS_CS_POST  SPI_FLASH_MODE_CTRL_BYPASS_CS_POST_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_MODE_CTRL_BYPASS_CS_POST_Msk instead */
#define SPI_FLASH_MODE_CTRL_MODE_SELECT_Pos 7                                              /**< (SPI_FLASH_MODE_CTRL) Set to 1 to use external bits for mode Position */
#define SPI_FLASH_MODE_CTRL_MODE_SELECT_Msk (0x1u << SPI_FLASH_MODE_CTRL_MODE_SELECT_Pos)  /**< (SPI_FLASH_MODE_CTRL) Set to 1 to use external bits for mode Mask */
#define SPI_FLASH_MODE_CTRL_MODE_SELECT     SPI_FLASH_MODE_CTRL_MODE_SELECT_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_MODE_CTRL_MODE_SELECT_Msk instead */
#define SPI_FLASH_MODE_CTRL_MASK            0x8Fu                                          /**< \deprecated (SPI_FLASH_MODE_CTRL) Register MASK  (Use SPI_FLASH_MODE_CTRL_Msk instead)  */
#define SPI_FLASH_MODE_CTRL_Msk             0x8Fu                                          /**< (SPI_FLASH_MODE_CTRL) Register Mask  */

/* -------- SPI_FLASH_TRANSACTION_CTRL : (SPI_FLASH Offset: 0x04) (R/W 32) Transaction Control (Cleared after each transaction completes) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CMD_COUNT:3;               /**< bit:   0..2  Number of bytes to be transferred or received */
    uint32_t :4;                        /**< bit:   3..6  Reserved */
    uint32_t FLASH_TRANS_START:1;       /**< bit:      7  Rising Edge Flast Transaction Start      */
    uint32_t WDATA_COUNT:24;            /**< bit:  8..31  Number of bytes to be programmed to flash */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_FLASH_TRANSACTION_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

