remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi_flash.h
#define SPI_FLASH_TRANSACTION_CTRL_OFFSET   0x04                                          /**<  (SPI_FLASH_TRANSACTION_CTRL) Transaction Control (Cleared after each transaction completes)  Offset */
#define SPI_FLASH_TRANSACTION_CTRL_RESETVALUE 0x04u                                         /**<  (SPI_FLASH_TRANSACTION_CTRL) Transaction Control (Cleared after each transaction completes)  Reset Value */

#define SPI_FLASH_TRANSACTION_CTRL_CMD_COUNT_Pos 0                                              /**< (SPI_FLASH_TRANSACTION_CTRL) Number of bytes to be transferred or received Position */
#define SPI_FLASH_TRANSACTION_CTRL_CMD_COUNT_Msk (0x7u << SPI_FLASH_TRANSACTION_CTRL_CMD_COUNT_Pos)  /**< (SPI_FLASH_TRANSACTION_CTRL) Number of bytes to be transferred or received Mask */
#define SPI_FLASH_TRANSACTION_CTRL_CMD_COUNT(value) (SPI_FLASH_TRANSACTION_CTRL_CMD_COUNT_Msk & ((value) << SPI_FLASH_TRANSACTION_CTRL_CMD_COUNT_Pos))
#define SPI_FLASH_TRANSACTION_CTRL_FLASH_TRANS_START_Pos 7                                              /**< (SPI_FLASH_TRANSACTION_CTRL) Rising Edge Flast Transaction Start Position */
#define SPI_FLASH_TRANSACTION_CTRL_FLASH_TRANS_START_Msk (0x1u << SPI_FLASH_TRANSACTION_CTRL_FLASH_TRANS_START_Pos)  /**< (SPI_FLASH_TRANSACTION_CTRL) Rising Edge Flast Transaction Start Mask */
#define SPI_FLASH_TRANSACTION_CTRL_FLASH_TRANS_START SPI_FLASH_TRANSACTION_CTRL_FLASH_TRANS_START_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_TRANSACTION_CTRL_FLASH_TRANS_START_Msk instead */
#define SPI_FLASH_TRANSACTION_CTRL_WDATA_COUNT_Pos 8                                              /**< (SPI_FLASH_TRANSACTION_CTRL) Number of bytes to be programmed to flash Position */
#define SPI_FLASH_TRANSACTION_CTRL_WDATA_COUNT_Msk (0xFFFFFFu << SPI_FLASH_TRANSACTION_CTRL_WDATA_COUNT_Pos)  /**< (SPI_FLASH_TRANSACTION_CTRL) Number of bytes to be programmed to flash Mask */
#define SPI_FLASH_TRANSACTION_CTRL_WDATA_COUNT(value) (SPI_FLASH_TRANSACTION_CTRL_WDATA_COUNT_Msk & ((value) << SPI_FLASH_TRANSACTION_CTRL_WDATA_COUNT_Pos))
#define SPI_FLASH_TRANSACTION_CTRL_MASK     0xFFFFFF87u                                    /**< \deprecated (SPI_FLASH_TRANSACTION_CTRL) Register MASK  (Use SPI_FLASH_TRANSACTION_CTRL_Msk instead)  */
#define SPI_FLASH_TRANSACTION_CTRL_Msk      0xFFFFFF87u                                    /**< (SPI_FLASH_TRANSACTION_CTRL) Register Mask  */

/* -------- SPI_FLASH_READ_CTRL : (SPI_FLASH Offset: 0x08) (R/W 32) Read Control (Cleared after each transaction completes) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RDATA_COUNT:24;            /**< bit:  0..23  Number of data bytes to be read from flash */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_FLASH_READ_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FLASH_READ_CTRL_OFFSET          0x08                                          /**<  (SPI_FLASH_READ_CTRL) Read Control (Cleared after each transaction completes)  Offset */
#define SPI_FLASH_READ_CTRL_RESETVALUE      0x00u                                         /**<  (SPI_FLASH_READ_CTRL) Read Control (Cleared after each transaction completes)  Reset Value */

#define SPI_FLASH_READ_CTRL_RDATA_COUNT_Pos 0                                              /**< (SPI_FLASH_READ_CTRL) Number of data bytes to be read from flash Position */
#define SPI_FLASH_READ_CTRL_RDATA_COUNT_Msk (0xFFFFFFu << SPI_FLASH_READ_CTRL_RDATA_COUNT_Pos)  /**< (SPI_FLASH_READ_CTRL) Number of data bytes to be read from flash Mask */
#define SPI_FLASH_READ_CTRL_RDATA_COUNT(value) (SPI_FLASH_READ_CTRL_RDATA_COUNT_Msk & ((value) << SPI_FLASH_READ_CTRL_RDATA_COUNT_Pos))
#define SPI_FLASH_READ_CTRL_MASK            0xFFFFFFu                                      /**< \deprecated (SPI_FLASH_READ_CTRL) Register MASK  (Use SPI_FLASH_READ_CTRL_Msk instead)  */
#define SPI_FLASH_READ_CTRL_Msk             0xFFFFFFu                                      /**< (SPI_FLASH_READ_CTRL) Register Mask  */

/* -------- SPI_FLASH_CMD_BUFFER0 : (SPI_FLASH Offset: 0x0c) (R/W 32) Command Buffer 0 (Bytes 3 - 0) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CMD_BUFFER0:32;            /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_FLASH_CMD_BUFFER0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FLASH_CMD_BUFFER0_OFFSET        0x0C                                          /**<  (SPI_FLASH_CMD_BUFFER0) Command Buffer 0 (Bytes 3 - 0)  Offset */
#define SPI_FLASH_CMD_BUFFER0_RESETVALUE    0x03u                                         /**<  (SPI_FLASH_CMD_BUFFER0) Command Buffer 0 (Bytes 3 - 0)  Reset Value */

#define SPI_FLASH_CMD_BUFFER0_CMD_BUFFER0_Pos 0                                              /**< (SPI_FLASH_CMD_BUFFER0)  Position */
#define SPI_FLASH_CMD_BUFFER0_CMD_BUFFER0_Msk (0xFFFFFFFFu << SPI_FLASH_CMD_BUFFER0_CMD_BUFFER0_Pos)  /**< (SPI_FLASH_CMD_BUFFER0)  Mask */
#define SPI_FLASH_CMD_BUFFER0_CMD_BUFFER0(value) (SPI_FLASH_CMD_BUFFER0_CMD_BUFFER0_Msk & ((value) << SPI_FLASH_CMD_BUFFER0_CMD_BUFFER0_Pos))
#define SPI_FLASH_CMD_BUFFER0_MASK          0xFFFFFFFFu                                    /**< \deprecated (SPI_FLASH_CMD_BUFFER0) Register MASK  (Use SPI_FLASH_CMD_BUFFER0_Msk instead)  */
#define SPI_FLASH_CMD_BUFFER0_Msk           0xFFFFFFFFu                                    /**< (SPI_FLASH_CMD_BUFFER0) Register Mask  */

/* -------- SPI_FLASH_CMD_BUFFER1 : (SPI_FLASH Offset: 0x10) (R/W 32) Command Buffer 1 (Bytes 7 - 4) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CMD_BUFFER1:32;            /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_FLASH_CMD_BUFFER1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FLASH_CMD_BUFFER1_OFFSET        0x10                                          /**<  (SPI_FLASH_CMD_BUFFER1) Command Buffer 1 (Bytes 7 - 4)  Offset */
#define SPI_FLASH_CMD_BUFFER1_RESETVALUE    0x00u                                         /**<  (SPI_FLASH_CMD_BUFFER1) Command Buffer 1 (Bytes 7 - 4)  Reset Value */

#define SPI_FLASH_CMD_BUFFER1_CMD_BUFFER1_Pos 0                                              /**< (SPI_FLASH_CMD_BUFFER1)  Position */
#define SPI_FLASH_CMD_BUFFER1_CMD_BUFFER1_Msk (0xFFFFFFFFu << SPI_FLASH_CMD_BUFFER1_CMD_BUFFER1_Pos)  /**< (SPI_FLASH_CMD_BUFFER1)  Mask */
#define SPI_FLASH_CMD_BUFFER1_CMD_BUFFER1(value) (SPI_FLASH_CMD_BUFFER1_CMD_BUFFER1_Msk & ((value) << SPI_FLASH_CMD_BUFFER1_CMD_BUFFER1_Pos))
#define SPI_FLASH_CMD_BUFFER1_MASK          0xFFFFFFFFu                                    /**< \deprecated (SPI_FLASH_CMD_BUFFER1) Register MASK  (Use SPI_FLASH_CMD_BUFFER1_Msk instead)  */
#define SPI_FLASH_CMD_BUFFER1_Msk           0xFFFFFFFFu                                    /**< (SPI_FLASH_CMD_BUFFER1) Register Mask  */

/* -------- SPI_FLASH_DIRECTION : (SPI_FLASH Offset: 0x14) (R/W 8) Read/Write bit for Bytes 7 - 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  DIRECTION:8;               /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_FLASH_DIRECTION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FLASH_DIRECTION_OFFSET          0x14                                          /**<  (SPI_FLASH_DIRECTION) Read/Write bit for Bytes 7 - 0  Offset */
#define SPI_FLASH_DIRECTION_RESETVALUE      0x0Fu                                         /**<  (SPI_FLASH_DIRECTION) Read/Write bit for Bytes 7 - 0  Reset Value */

#define SPI_FLASH_DIRECTION_DIRECTION_Pos   0                                              /**< (SPI_FLASH_DIRECTION)  Position */
#define SPI_FLASH_DIRECTION_DIRECTION_Msk   (0xFFu << SPI_FLASH_DIRECTION_DIRECTION_Pos)   /**< (SPI_FLASH_DIRECTION)  Mask */
#define SPI_FLASH_DIRECTION_DIRECTION(value) (SPI_FLASH_DIRECTION_DIRECTION_Msk & ((value) << SPI_FLASH_DIRECTION_DIRECTION_Pos))
#define SPI_FLASH_DIRECTION_MASK            0xFFu                                          /**< \deprecated (SPI_FLASH_DIRECTION) Register MASK  (Use SPI_FLASH_DIRECTION_Msk instead)  */
#define SPI_FLASH_DIRECTION_Msk             0xFFu                                          /**< (SPI_FLASH_DIRECTION) Register Mask  */

