remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi_flash.h
/* -------- SPI_FLASH_IRQ_STATUS : (SPI_FLASH Offset: 0x18) (/W 8) IRQ Status (Write 0 to bit to clear, Read clears interupts) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  FLASH_TRANS_DONE:1;        /**< bit:      0  Current Flash Transaction Done           */
    uint8_t  AHB_ERROR_RESPONSE:1;      /**< bit:      1  AHB Error Response                       */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} SPI_FLASH_IRQ_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FLASH_IRQ_STATUS_OFFSET         0x18                                          /**<  (SPI_FLASH_IRQ_STATUS) IRQ Status (Write 0 to bit to clear, Read clears interupts)  Offset */
#define SPI_FLASH_IRQ_STATUS_RESETVALUE     0x00u                                         /**<  (SPI_FLASH_IRQ_STATUS) IRQ Status (Write 0 to bit to clear, Read clears interupts)  Reset Value */

#define SPI_FLASH_IRQ_STATUS_FLASH_TRANS_DONE_Pos 0                                              /**< (SPI_FLASH_IRQ_STATUS) Current Flash Transaction Done Position */
#define SPI_FLASH_IRQ_STATUS_FLASH_TRANS_DONE_Msk (0x1u << SPI_FLASH_IRQ_STATUS_FLASH_TRANS_DONE_Pos)  /**< (SPI_FLASH_IRQ_STATUS) Current Flash Transaction Done Mask */
#define SPI_FLASH_IRQ_STATUS_FLASH_TRANS_DONE SPI_FLASH_IRQ_STATUS_FLASH_TRANS_DONE_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_IRQ_STATUS_FLASH_TRANS_DONE_Msk instead */
#define SPI_FLASH_IRQ_STATUS_AHB_ERROR_RESPONSE_Pos 1                                              /**< (SPI_FLASH_IRQ_STATUS) AHB Error Response Position */
#define SPI_FLASH_IRQ_STATUS_AHB_ERROR_RESPONSE_Msk (0x1u << SPI_FLASH_IRQ_STATUS_AHB_ERROR_RESPONSE_Pos)  /**< (SPI_FLASH_IRQ_STATUS) AHB Error Response Mask */
#define SPI_FLASH_IRQ_STATUS_AHB_ERROR_RESPONSE SPI_FLASH_IRQ_STATUS_AHB_ERROR_RESPONSE_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_IRQ_STATUS_AHB_ERROR_RESPONSE_Msk instead */
#define SPI_FLASH_IRQ_STATUS_MASK           0x03u                                          /**< \deprecated (SPI_FLASH_IRQ_STATUS) Register MASK  (Use SPI_FLASH_IRQ_STATUS_Msk instead)  */
#define SPI_FLASH_IRQ_STATUS_Msk            0x03u                                          /**< (SPI_FLASH_IRQ_STATUS) Register Mask  */

/* -------- SPI_FLASH_DMA_START_ADDRESS : (SPI_FLASH Offset: 0x1c) (R/W 32) DMA Starting Address -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DMA_START_ADDRESS:32;      /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SPI_FLASH_DMA_START_ADDRESS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FLASH_DMA_START_ADDRESS_OFFSET  0x1C                                          /**<  (SPI_FLASH_DMA_START_ADDRESS) DMA Starting Address  Offset */
#define SPI_FLASH_DMA_START_ADDRESS_RESETVALUE 0x00u                                         /**<  (SPI_FLASH_DMA_START_ADDRESS) DMA Starting Address  Reset Value */

#define SPI_FLASH_DMA_START_ADDRESS_DMA_START_ADDRESS_Pos 0                                              /**< (SPI_FLASH_DMA_START_ADDRESS)  Position */
#define SPI_FLASH_DMA_START_ADDRESS_DMA_START_ADDRESS_Msk (0xFFFFFFFFu << SPI_FLASH_DMA_START_ADDRESS_DMA_START_ADDRESS_Pos)  /**< (SPI_FLASH_DMA_START_ADDRESS)  Mask */
#define SPI_FLASH_DMA_START_ADDRESS_DMA_START_ADDRESS(value) (SPI_FLASH_DMA_START_ADDRESS_DMA_START_ADDRESS_Msk & ((value) << SPI_FLASH_DMA_START_ADDRESS_DMA_START_ADDRESS_Pos))
#define SPI_FLASH_DMA_START_ADDRESS_MASK    0xFFFFFFFFu                                    /**< \deprecated (SPI_FLASH_DMA_START_ADDRESS) Register MASK  (Use SPI_FLASH_DMA_START_ADDRESS_Msk instead)  */
#define SPI_FLASH_DMA_START_ADDRESS_Msk     0xFFFFFFFFu                                    /**< (SPI_FLASH_DMA_START_ADDRESS) Register Mask  */

/* -------- SPI_FLASH_CONFIG : (SPI_FLASH Offset: 0x20) (R/W 16) SPI Flash Configuration -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t ENDIANNESS:1;              /**< bit:      0  1 for Little Endian                      */
    uint16_t REVERSE_CMD_BUFFER:1;      /**< bit:      1  Reverse bits of every byte in cmd_buffer */
    uint16_t RDATA_REVERSE:1;           /**< bit:      2  Reverse bits of every data byte read from flash */
    uint16_t REVERSE_INCOMIND_DATA:1;   /**< bit:      3  Reverse bits of status registers read from flash */
    uint16_t SPI_INTERFACE_CONFIG_DEBUG:4;  /**< bit:   4..7  Debug only                               */
    uint16_t WDATA_REVERSE:1;           /**< bit:      8  Reverse bits of every data byte written to flash */
    uint16_t :7;                        /**< bit:  9..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} SPI_FLASH_CONFIG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FLASH_CONFIG_OFFSET             0x20                                          /**<  (SPI_FLASH_CONFIG) SPI Flash Configuration  Offset */
#define SPI_FLASH_CONFIG_RESETVALUE         0x103u                                        /**<  (SPI_FLASH_CONFIG) SPI Flash Configuration  Reset Value */

#define SPI_FLASH_CONFIG_ENDIANNESS_Pos     0                                              /**< (SPI_FLASH_CONFIG) 1 for Little Endian Position */
#define SPI_FLASH_CONFIG_ENDIANNESS_Msk     (0x1u << SPI_FLASH_CONFIG_ENDIANNESS_Pos)      /**< (SPI_FLASH_CONFIG) 1 for Little Endian Mask */
#define SPI_FLASH_CONFIG_ENDIANNESS         SPI_FLASH_CONFIG_ENDIANNESS_Msk                /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_CONFIG_ENDIANNESS_Msk instead */
#define SPI_FLASH_CONFIG_REVERSE_CMD_BUFFER_Pos 1                                              /**< (SPI_FLASH_CONFIG) Reverse bits of every byte in cmd_buffer Position */
#define SPI_FLASH_CONFIG_REVERSE_CMD_BUFFER_Msk (0x1u << SPI_FLASH_CONFIG_REVERSE_CMD_BUFFER_Pos)  /**< (SPI_FLASH_CONFIG) Reverse bits of every byte in cmd_buffer Mask */
#define SPI_FLASH_CONFIG_REVERSE_CMD_BUFFER SPI_FLASH_CONFIG_REVERSE_CMD_BUFFER_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_CONFIG_REVERSE_CMD_BUFFER_Msk instead */
#define SPI_FLASH_CONFIG_RDATA_REVERSE_Pos  2                                              /**< (SPI_FLASH_CONFIG) Reverse bits of every data byte read from flash Position */
#define SPI_FLASH_CONFIG_RDATA_REVERSE_Msk  (0x1u << SPI_FLASH_CONFIG_RDATA_REVERSE_Pos)   /**< (SPI_FLASH_CONFIG) Reverse bits of every data byte read from flash Mask */
#define SPI_FLASH_CONFIG_RDATA_REVERSE      SPI_FLASH_CONFIG_RDATA_REVERSE_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_CONFIG_RDATA_REVERSE_Msk instead */
#define SPI_FLASH_CONFIG_REVERSE_INCOMIND_DATA_Pos 3                                              /**< (SPI_FLASH_CONFIG) Reverse bits of status registers read from flash Position */
#define SPI_FLASH_CONFIG_REVERSE_INCOMIND_DATA_Msk (0x1u << SPI_FLASH_CONFIG_REVERSE_INCOMIND_DATA_Pos)  /**< (SPI_FLASH_CONFIG) Reverse bits of status registers read from flash Mask */
#define SPI_FLASH_CONFIG_REVERSE_INCOMIND_DATA SPI_FLASH_CONFIG_REVERSE_INCOMIND_DATA_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_CONFIG_REVERSE_INCOMIND_DATA_Msk instead */
#define SPI_FLASH_CONFIG_SPI_INTERFACE_CONFIG_DEBUG_Pos 4                                              /**< (SPI_FLASH_CONFIG) Debug only Position */
#define SPI_FLASH_CONFIG_SPI_INTERFACE_CONFIG_DEBUG_Msk (0xFu << SPI_FLASH_CONFIG_SPI_INTERFACE_CONFIG_DEBUG_Pos)  /**< (SPI_FLASH_CONFIG) Debug only Mask */
#define SPI_FLASH_CONFIG_SPI_INTERFACE_CONFIG_DEBUG(value) (SPI_FLASH_CONFIG_SPI_INTERFACE_CONFIG_DEBUG_Msk & ((value) << SPI_FLASH_CONFIG_SPI_INTERFACE_CONFIG_DEBUG_Pos))
#define SPI_FLASH_CONFIG_WDATA_REVERSE_Pos  8                                              /**< (SPI_FLASH_CONFIG) Reverse bits of every data byte written to flash Position */
#define SPI_FLASH_CONFIG_WDATA_REVERSE_Msk  (0x1u << SPI_FLASH_CONFIG_WDATA_REVERSE_Pos)   /**< (SPI_FLASH_CONFIG) Reverse bits of every data byte written to flash Mask */
#define SPI_FLASH_CONFIG_WDATA_REVERSE      SPI_FLASH_CONFIG_WDATA_REVERSE_Msk             /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_CONFIG_WDATA_REVERSE_Msk instead */
#define SPI_FLASH_CONFIG_MASK               0x1FFu                                         /**< \deprecated (SPI_FLASH_CONFIG) Register MASK  (Use SPI_FLASH_CONFIG_Msk instead)  */
#define SPI_FLASH_CONFIG_Msk                0x1FFu                                         /**< (SPI_FLASH_CONFIG) Register Mask  */

