remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi_flash.h
/* -------- SPI_FLASH_TX_CONTROL : (SPI_FLASH Offset: 0x24) (R/W 16) TX Control -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t DRIVE_0_ON_TX:1;           /**< bit:      0  Drive 0 on TX while reading              */
    uint16_t DRIVE_1_ON_TX:1;           /**< bit:      1  Drive 1 on TX while reading              */
    uint16_t TOGGLE_ON_TX:1;            /**< bit:      2  Toggle TX while reading                  */
    uint16_t DUMMY_ON_TX:1;             /**< bit:      3  Send dummy_byte while reading            */
    uint16_t :4;                        /**< bit:   4..7  Reserved */
    uint16_t DUMMY_BYTE:8;              /**< bit:  8..15  Byte to be sent for dummy_on_tx option   */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} SPI_FLASH_TX_CONTROL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FLASH_TX_CONTROL_OFFSET         0x24                                          /**<  (SPI_FLASH_TX_CONTROL) TX Control  Offset */
#define SPI_FLASH_TX_CONTROL_RESETVALUE     0x00u                                         /**<  (SPI_FLASH_TX_CONTROL) TX Control  Reset Value */

#define SPI_FLASH_TX_CONTROL_DRIVE_0_ON_TX_Pos 0                                              /**< (SPI_FLASH_TX_CONTROL) Drive 0 on TX while reading Position */
#define SPI_FLASH_TX_CONTROL_DRIVE_0_ON_TX_Msk (0x1u << SPI_FLASH_TX_CONTROL_DRIVE_0_ON_TX_Pos)  /**< (SPI_FLASH_TX_CONTROL) Drive 0 on TX while reading Mask */
#define SPI_FLASH_TX_CONTROL_DRIVE_0_ON_TX  SPI_FLASH_TX_CONTROL_DRIVE_0_ON_TX_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_TX_CONTROL_DRIVE_0_ON_TX_Msk instead */
#define SPI_FLASH_TX_CONTROL_DRIVE_1_ON_TX_Pos 1                                              /**< (SPI_FLASH_TX_CONTROL) Drive 1 on TX while reading Position */
#define SPI_FLASH_TX_CONTROL_DRIVE_1_ON_TX_Msk (0x1u << SPI_FLASH_TX_CONTROL_DRIVE_1_ON_TX_Pos)  /**< (SPI_FLASH_TX_CONTROL) Drive 1 on TX while reading Mask */
#define SPI_FLASH_TX_CONTROL_DRIVE_1_ON_TX  SPI_FLASH_TX_CONTROL_DRIVE_1_ON_TX_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_TX_CONTROL_DRIVE_1_ON_TX_Msk instead */
#define SPI_FLASH_TX_CONTROL_TOGGLE_ON_TX_Pos 2                                              /**< (SPI_FLASH_TX_CONTROL) Toggle TX while reading Position */
#define SPI_FLASH_TX_CONTROL_TOGGLE_ON_TX_Msk (0x1u << SPI_FLASH_TX_CONTROL_TOGGLE_ON_TX_Pos)  /**< (SPI_FLASH_TX_CONTROL) Toggle TX while reading Mask */
#define SPI_FLASH_TX_CONTROL_TOGGLE_ON_TX   SPI_FLASH_TX_CONTROL_TOGGLE_ON_TX_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_TX_CONTROL_TOGGLE_ON_TX_Msk instead */
#define SPI_FLASH_TX_CONTROL_DUMMY_ON_TX_Pos 3                                              /**< (SPI_FLASH_TX_CONTROL) Send dummy_byte while reading Position */
#define SPI_FLASH_TX_CONTROL_DUMMY_ON_TX_Msk (0x1u << SPI_FLASH_TX_CONTROL_DUMMY_ON_TX_Pos)  /**< (SPI_FLASH_TX_CONTROL) Send dummy_byte while reading Mask */
#define SPI_FLASH_TX_CONTROL_DUMMY_ON_TX    SPI_FLASH_TX_CONTROL_DUMMY_ON_TX_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_TX_CONTROL_DUMMY_ON_TX_Msk instead */
#define SPI_FLASH_TX_CONTROL_DUMMY_BYTE_Pos 8                                              /**< (SPI_FLASH_TX_CONTROL) Byte to be sent for dummy_on_tx option Position */
#define SPI_FLASH_TX_CONTROL_DUMMY_BYTE_Msk (0xFFu << SPI_FLASH_TX_CONTROL_DUMMY_BYTE_Pos)  /**< (SPI_FLASH_TX_CONTROL) Byte to be sent for dummy_on_tx option Mask */
#define SPI_FLASH_TX_CONTROL_DUMMY_BYTE(value) (SPI_FLASH_TX_CONTROL_DUMMY_BYTE_Msk & ((value) << SPI_FLASH_TX_CONTROL_DUMMY_BYTE_Pos))
#define SPI_FLASH_TX_CONTROL_MASK           0xFF0Fu                                        /**< \deprecated (SPI_FLASH_TX_CONTROL) Register MASK  (Use SPI_FLASH_TX_CONTROL_Msk instead)  */
#define SPI_FLASH_TX_CONTROL_Msk            0xFF0Fu                                        /**< (SPI_FLASH_TX_CONTROL) Register Mask  */

/* -------- SPI_FLASH_STATUS : (SPI_FLASH Offset: 0x28) (R/ 16) Misc Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t AHB_MASTER_STATE:2;        /**< bit:   0..1  AHB Master State                         */
    uint16_t :2;                        /**< bit:   2..3  Reserved */
    uint16_t FIFO_CTRL_STATE:3;         /**< bit:   4..6  FIFO Control State                       */
    uint16_t :1;                        /**< bit:      7  Reserved */
    uint16_t SPI_MASTER_STATE:3;        /**< bit:  8..10  SPI Master State                         */
    uint16_t :1;                        /**< bit:     11  Reserved */
    uint16_t SPI_MASTER_CSN:1;          /**< bit:     12  Inverted version of the SPI Master Chip Select */
    uint16_t :3;                        /**< bit: 13..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} SPI_FLASH_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SPI_FLASH_STATUS_OFFSET             0x28                                          /**<  (SPI_FLASH_STATUS) Misc Status  Offset */
#define SPI_FLASH_STATUS_RESETVALUE         0x00u                                         /**<  (SPI_FLASH_STATUS) Misc Status  Reset Value */

#define SPI_FLASH_STATUS_AHB_MASTER_STATE_Pos 0                                              /**< (SPI_FLASH_STATUS) AHB Master State Position */
#define SPI_FLASH_STATUS_AHB_MASTER_STATE_Msk (0x3u << SPI_FLASH_STATUS_AHB_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) AHB Master State Mask */
#define SPI_FLASH_STATUS_AHB_MASTER_STATE(value) (SPI_FLASH_STATUS_AHB_MASTER_STATE_Msk & ((value) << SPI_FLASH_STATUS_AHB_MASTER_STATE_Pos))
#define   SPI_FLASH_STATUS_AHB_MASTER_STATE_0_Val 0x0u                                           /**< (SPI_FLASH_STATUS) IDLE  */
#define   SPI_FLASH_STATUS_AHB_MASTER_STATE_1_Val 0x1u                                           /**< (SPI_FLASH_STATUS) WAIT_GRANT  */
#define   SPI_FLASH_STATUS_AHB_MASTER_STATE_2_Val 0x2u                                           /**< (SPI_FLASH_STATUS) ADDR_PHASE  */
#define   SPI_FLASH_STATUS_AHB_MASTER_STATE_3_Val 0x3u                                           /**< (SPI_FLASH_STATUS) DATA_PHASE  */
#define SPI_FLASH_STATUS_AHB_MASTER_STATE_0 (SPI_FLASH_STATUS_AHB_MASTER_STATE_0_Val << SPI_FLASH_STATUS_AHB_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) IDLE Position  */
#define SPI_FLASH_STATUS_AHB_MASTER_STATE_1 (SPI_FLASH_STATUS_AHB_MASTER_STATE_1_Val << SPI_FLASH_STATUS_AHB_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) WAIT_GRANT Position  */
#define SPI_FLASH_STATUS_AHB_MASTER_STATE_2 (SPI_FLASH_STATUS_AHB_MASTER_STATE_2_Val << SPI_FLASH_STATUS_AHB_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) ADDR_PHASE Position  */
#define SPI_FLASH_STATUS_AHB_MASTER_STATE_3 (SPI_FLASH_STATUS_AHB_MASTER_STATE_3_Val << SPI_FLASH_STATUS_AHB_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) DATA_PHASE Position  */
#define SPI_FLASH_STATUS_FIFO_CTRL_STATE_Pos 4                                              /**< (SPI_FLASH_STATUS) FIFO Control State Position */
#define SPI_FLASH_STATUS_FIFO_CTRL_STATE_Msk (0x7u << SPI_FLASH_STATUS_FIFO_CTRL_STATE_Pos)  /**< (SPI_FLASH_STATUS) FIFO Control State Mask */
#define SPI_FLASH_STATUS_FIFO_CTRL_STATE(value) (SPI_FLASH_STATUS_FIFO_CTRL_STATE_Msk & ((value) << SPI_FLASH_STATUS_FIFO_CTRL_STATE_Pos))
#define   SPI_FLASH_STATUS_FIFO_CTRL_STATE_0_Val 0x0u                                           /**< (SPI_FLASH_STATUS) FLASH_IDLE  */
#define   SPI_FLASH_STATUS_FIFO_CTRL_STATE_1_Val 0x1u                                           /**< (SPI_FLASH_STATUS) GET_DATA_FROM_FLASH  */
#define   SPI_FLASH_STATUS_FIFO_CTRL_STATE_2_Val 0x2u                                           /**< (SPI_FLASH_STATUS) WRITE_DATA_TO_AHB  */
#define   SPI_FLASH_STATUS_FIFO_CTRL_STATE_3_Val 0x3u                                           /**< (SPI_FLASH_STATUS) GET_DATA_FROM_AHB  */
#define   SPI_FLASH_STATUS_FIFO_CTRL_STATE_4_Val 0x4u                                           /**< (SPI_FLASH_STATUS) WRITE_DATA_TO_FLASH  */
#define SPI_FLASH_STATUS_FIFO_CTRL_STATE_0  (SPI_FLASH_STATUS_FIFO_CTRL_STATE_0_Val << SPI_FLASH_STATUS_FIFO_CTRL_STATE_Pos)  /**< (SPI_FLASH_STATUS) FLASH_IDLE Position  */
#define SPI_FLASH_STATUS_FIFO_CTRL_STATE_1  (SPI_FLASH_STATUS_FIFO_CTRL_STATE_1_Val << SPI_FLASH_STATUS_FIFO_CTRL_STATE_Pos)  /**< (SPI_FLASH_STATUS) GET_DATA_FROM_FLASH Position  */
#define SPI_FLASH_STATUS_FIFO_CTRL_STATE_2  (SPI_FLASH_STATUS_FIFO_CTRL_STATE_2_Val << SPI_FLASH_STATUS_FIFO_CTRL_STATE_Pos)  /**< (SPI_FLASH_STATUS) WRITE_DATA_TO_AHB Position  */
#define SPI_FLASH_STATUS_FIFO_CTRL_STATE_3  (SPI_FLASH_STATUS_FIFO_CTRL_STATE_3_Val << SPI_FLASH_STATUS_FIFO_CTRL_STATE_Pos)  /**< (SPI_FLASH_STATUS) GET_DATA_FROM_AHB Position  */
#define SPI_FLASH_STATUS_FIFO_CTRL_STATE_4  (SPI_FLASH_STATUS_FIFO_CTRL_STATE_4_Val << SPI_FLASH_STATUS_FIFO_CTRL_STATE_Pos)  /**< (SPI_FLASH_STATUS) WRITE_DATA_TO_FLASH Position  */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos 8                                              /**< (SPI_FLASH_STATUS) SPI Master State Position */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE_Msk (0x7u << SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) SPI Master State Mask */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE(value) (SPI_FLASH_STATUS_SPI_MASTER_STATE_Msk & ((value) << SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos))
#define   SPI_FLASH_STATUS_SPI_MASTER_STATE_0_Val 0x0u                                           /**< (SPI_FLASH_STATUS) IDLE  */
#define   SPI_FLASH_STATUS_SPI_MASTER_STATE_1_Val 0x1u                                           /**< (SPI_FLASH_STATUS) READ  */
#define   SPI_FLASH_STATUS_SPI_MASTER_STATE_2_Val 0x2u                                           /**< (SPI_FLASH_STATUS) WRITE  */
#define   SPI_FLASH_STATUS_SPI_MASTER_STATE_3_Val 0x3u                                           /**< (SPI_FLASH_STATUS) READ_FLASH  */
#define   SPI_FLASH_STATUS_SPI_MASTER_STATE_4_Val 0x4u                                           /**< (SPI_FLASH_STATUS) WRITE_FLASH  */
#define   SPI_FLASH_STATUS_SPI_MASTER_STATE_5_Val 0x5u                                           /**< (SPI_FLASH_STATUS) PRE_ACTION  */
#define   SPI_FLASH_STATUS_SPI_MASTER_STATE_6_Val 0x6u                                           /**< (SPI_FLASH_STATUS) POST_ACTION  */
#define   SPI_FLASH_STATUS_SPI_MASTER_STATE_7_Val 0x7u                                           /**< (SPI_FLASH_STATUS) WAIT_AHB  */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE_0 (SPI_FLASH_STATUS_SPI_MASTER_STATE_0_Val << SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) IDLE Position  */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE_1 (SPI_FLASH_STATUS_SPI_MASTER_STATE_1_Val << SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) READ Position  */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE_2 (SPI_FLASH_STATUS_SPI_MASTER_STATE_2_Val << SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) WRITE Position  */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE_3 (SPI_FLASH_STATUS_SPI_MASTER_STATE_3_Val << SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) READ_FLASH Position  */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE_4 (SPI_FLASH_STATUS_SPI_MASTER_STATE_4_Val << SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) WRITE_FLASH Position  */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE_5 (SPI_FLASH_STATUS_SPI_MASTER_STATE_5_Val << SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) PRE_ACTION Position  */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE_6 (SPI_FLASH_STATUS_SPI_MASTER_STATE_6_Val << SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) POST_ACTION Position  */
#define SPI_FLASH_STATUS_SPI_MASTER_STATE_7 (SPI_FLASH_STATUS_SPI_MASTER_STATE_7_Val << SPI_FLASH_STATUS_SPI_MASTER_STATE_Pos)  /**< (SPI_FLASH_STATUS) WAIT_AHB Position  */
#define SPI_FLASH_STATUS_SPI_MASTER_CSN_Pos 12                                             /**< (SPI_FLASH_STATUS) Inverted version of the SPI Master Chip Select Position */
#define SPI_FLASH_STATUS_SPI_MASTER_CSN_Msk (0x1u << SPI_FLASH_STATUS_SPI_MASTER_CSN_Pos)  /**< (SPI_FLASH_STATUS) Inverted version of the SPI Master Chip Select Mask */
#define SPI_FLASH_STATUS_SPI_MASTER_CSN     SPI_FLASH_STATUS_SPI_MASTER_CSN_Msk            /**< \deprecated Old style mask definition for 1 bit bitfield. Use SPI_FLASH_STATUS_SPI_MASTER_CSN_Msk instead */
#define SPI_FLASH_STATUS_MASK               0x1773u                                        /**< \deprecated (SPI_FLASH_STATUS) Register MASK  (Use SPI_FLASH_STATUS_Msk instead)  */
#define SPI_FLASH_STATUS_Msk                0x1773u                                        /**< (SPI_FLASH_STATUS) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief SPI_FLASH hardware registers */
typedef struct {  /* SPI Flash Controller */
  RwReg8  MODE_CTRL;      /**< (SPI_FLASH Offset: 0x00) SPI Flash Mode Control */
  __I  uint8_t  Reserved1[3];
  RwReg   TRANSACTION_CTRL; /**< (SPI_FLASH Offset: 0x04) Transaction Control (Cleared after each transaction completes) */
  RwReg   READ_CTRL;      /**< (SPI_FLASH Offset: 0x08) Read Control (Cleared after each transaction completes) */
  RwReg   CMD_BUFFER0;    /**< (SPI_FLASH Offset: 0x0C) Command Buffer 0 (Bytes 3 - 0) */
  RwReg   CMD_BUFFER1;    /**< (SPI_FLASH Offset: 0x10) Command Buffer 1 (Bytes 7 - 4) */
  RwReg8  DIRECTION;      /**< (SPI_FLASH Offset: 0x14) Read/Write bit for Bytes 7 - 0 */
  __I  uint8_t  Reserved2[3];
  WoReg8  IRQ_STATUS;     /**< (SPI_FLASH Offset: 0x18) IRQ Status (Write 0 to bit to clear, Read clears interupts) */
  __I  uint8_t  Reserved3[3];
  RwReg   DMA_START_ADDRESS; /**< (SPI_FLASH Offset: 0x1C) DMA Starting Address */
  RwReg16 CONFIG;         /**< (SPI_FLASH Offset: 0x20) SPI Flash Configuration */
  __I  uint8_t  Reserved4[2];
  RwReg16 TX_CONTROL;     /**< (SPI_FLASH Offset: 0x24) TX Control */
  __I  uint8_t  Reserved5[2];
  RoReg16 STATUS;         /**< (SPI_FLASH Offset: 0x28) Misc Status */
} SpiFlash;

