remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/spi_flash.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief SPI_FLASH hardware registers */
typedef struct {  /* SPI Flash Controller */
  __IO SPI_FLASH_MODE_CTRL_Type       MODE_CTRL;      /**< Offset: 0x00 (R/W   8) SPI Flash Mode Control */
       RoReg8                         Reserved1[0x3];
  __IO SPI_FLASH_TRANSACTION_CTRL_Type TRANSACTION_CTRL; /**< Offset: 0x04 (R/W  32) Transaction Control (Cleared after each transaction completes) */
  __IO SPI_FLASH_READ_CTRL_Type       READ_CTRL;      /**< Offset: 0x08 (R/W  32) Read Control (Cleared after each transaction completes) */
  __IO SPI_FLASH_CMD_BUFFER0_Type     CMD_BUFFER0;    /**< Offset: 0x0C (R/W  32) Command Buffer 0 (Bytes 3 - 0) */
  __IO SPI_FLASH_CMD_BUFFER1_Type     CMD_BUFFER1;    /**< Offset: 0x10 (R/W  32) Command Buffer 1 (Bytes 7 - 4) */
  __IO SPI_FLASH_DIRECTION_Type       DIRECTION;      /**< Offset: 0x14 (R/W   8) Read/Write bit for Bytes 7 - 0 */
       RoReg8                         Reserved2[0x3];
  __O  SPI_FLASH_IRQ_STATUS_Type      IRQ_STATUS;     /**< Offset: 0x18 ( /W   8) IRQ Status (Write 0 to bit to clear, Read clears interupts) */
       RoReg8                         Reserved3[0x3];
  __IO SPI_FLASH_DMA_START_ADDRESS_Type DMA_START_ADDRESS; /**< Offset: 0x1C (R/W  32) DMA Starting Address */
  __IO SPI_FLASH_CONFIG_Type          CONFIG;         /**< Offset: 0x20 (R/W  16) SPI Flash Configuration */
       RoReg8                         Reserved4[0x2];
  __IO SPI_FLASH_TX_CONTROL_Type      TX_CONTROL;     /**< Offset: 0x24 (R/W  16) TX Control */
       RoReg8                         Reserved5[0x2];
  __I  SPI_FLASH_STATUS_Type          STATUS;         /**< Offset: 0x28 (R/   16) Misc Status */
} SpiFlash;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_SPI_FLASH_COMPONENT_ */
